<a href="https://colab.research.google.com/github/hannasss/SOLUX_summer_data/blob/master/pandas8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
student_list = [{'name':'John',
                'major':"Computer Science",
                'sex':"male"},
                {'name':'Nate',
                'major':"Computer Science",
                'sex':"male"},
                {'name':'Edward',
                'major':"Computer Science",
                'sex':"male"},
                {'name':'Zara',
                'major':"Psychology",
                'sex':"female"},
                {'name':'John',
                'major':"Computer Science",
                'sex':"male"},
    
]
df = pd.DataFrame(student_list,columns = ['name','major','sex'])
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4    John  Computer Science    male

데이터 중복 여부 확인

In [ ]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
dtype: bool

중복 데이터 삭제

In [ ]:
df.drop_duplicates()

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female

In [ ]:
student_list = [{'name':'John',
                'major':"Computer Science",
                'sex':"male"},
                {'name':'Nate',
                'major':"Computer Science",
                'sex':"male"},
                {'name':'Edward',
                'major':"Computer Science",
                'sex':"male"},
                {'name':'Zara',
                'major':"Psychology",
                'sex':"female"},
                {'name':'Wendy',
                'major':"Economics",
                'sex':"female"},
                {'name':'Nate',
                'major':None,
                'sex':"male"},
                {'name':'John',
                'major':"Economics",
                'sex':"male"},
    
]
df = pd.DataFrame(student_list,columns = ['name','major','sex'])
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female
5    Nate              None    male
6    John         Economics    male

'name'에서 중복 데이터 값 확인

In [ ]:
df.duplicated(['name'])

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

'name' 에서의 중복 데이터 삭제

In [ ]:
df.drop_duplicates(['name'])

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female